OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/overInterDyMFoam/twoSquaresOutDomain/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    movingZone1
    {
        solidBodyMotionFunction multiMotion;
        multiMotionCoeffs
        {
            one
            {
                solidBodyMotionFunction linearMotion;
                velocity    (-0.1 -0.1 0);
            }
            two
            {
                solidBodyMotionFunction rotatingMotion;
                origin      (0.005 0.005 0.005);
                axis        (0 0 1);
                omega       20.0;
            }
        }
    }

    movingZone2
    {
        solidBodyMotionFunction linearMotion;
        linearMotionCoeffs
        {
            velocity    (0.1 0 0);
        }
    }
}


// ************************************************************************* //
